Tekla.Structures.AnalysisInternal.DotAnalysisPosition
The serialization structure for AnalysisPosition.

Tekla.Structures.AnalysisInternal.DotAnalysisPosition._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisPosition._NodeId
The identifier of the node.

Tekla.Structures.AnalysisInternal.DotAnalysisPosition._Type
The type of the position.

Tekla.Structures.AnalysisInternal.DotAnalysisPosition.ToStruct(Tekla.Structures.Analysis.AnalysisPosition)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPosition.FromStruct(Tekla.Structures.Analysis.AnalysisPosition)
DO NOT USE! For internal usage only!
P: P.